src/main/resources/atscale-4/0003-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><BeginSession xmlns="urn:schemas-microsoft-com:xml-analysis"/><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="921"/></soap:Header><soap:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement xmlns="urn:schemas-microsoft-com:xml-analysis"/></Command><Properties><PropertyList><SafetyOptions>2</SafetyOptions><MdxMissingMemberMode>Error</MdxMissingMemberMode><DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse><DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID><DbpropMsmdRequestID>ADEAA02B-95AF-42CD-819E-A51C79356DF9</DbpropMsmdRequestID><LocaleIdentifier>1033</LocaleIdentifier><DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility><DbpropMsmdSubqueries>2</DbpropMsmdSubqueries></PropertyList></Properties></Execute></soap:Body></soap:Envelope>